WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_calib_lsi_clock.c
/****************************************************************************
 * /configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_calibrate_lsi.c
 * 
 *   Copyright (C) 2022 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

// Note: There's a lot of useful code in /arch/arm/src/stm32f7/stm32_rtc.c.
// However, the public functions are limited to common things like setting
// time and setting alarms. The type of low-level functionality needed here
// is not available. Some of the stm32_rtc.c code has be duplicated here.
//
// In STMicro's AN4759 Rev 7 section 2.1.4 there is a brief section on
// adjusting the source clock.
//
// This module first calibrates the LSI RC clock so it reasonably generates
// the 1 Hz clock needed by the F7's RTC hardware.

// Testing showed that these clocks
// are very inaccurate. This list shows 7 random F7Feature boards.
// 1-100 LSI Average:31017.77Hz (-5.34%,  -3:12/hr), Hi:31118.31, Lo:30878.10
// 2-100 LSI Average:29721.36Hz (-9.30%,  -5:34/hr), Hi:29813.66, Lo:29593.09
// 3-100 LSI Average:29906.54Hz (-8.73%,  -5:14/hr), Hi:30009.38, Lo:29776.67
// 4-100 LSI Average:33934.25Hz (+3.56%,  +2:08/hr), Hi:34030.49, Lo:33814.72
// 5-100 LSI Average:29702.97Hz (-9.35%,  -5:36/hr), Hi:29804.41, Lo:29583.98
// 6-100 LSI Average:29384.76Hz (-10.32%, -6:11/hr), Hi:29493.09, Lo:29259.37
// 7-100 LSI Average:33970.28Hz (+3.67%,  +2:12/hr), Hi:34090.91, Lo:33862.43
// Using a function generator the test results were
//   100 LSI Average:32775.69Hz (+0.02%, +0:00/hr), Hi:32775.69, Lo:32764.51
// Proving that the frequency measurement code was working properly.

// The goal of this module is to adjust the RTC so that the variation in
// the LSI clock speed can be compensated for.

// Note: the underlying STM32_rtc.c driver doesn't support CONFIG_RTC_HIRES

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdlib.h>
#include <math.h>
#include <syslog.h>

#include <arch/board/board.h>
#include <nuttx/arch.h>
#include <nuttx/kthread.h>
#include "stm32_tim.h"
#include "stm32_pwr.h"
#include "stm32_rtc.h"
#include "stm32_exti.h"

#include <meadow/hcom_shared_common.h>
#include "../hcom_nx/hcom_nx_common.h"

#include "pwrmgmt_local.h"
#include <meadow/hcom_bbreg_defn.h>

#if defined (CONFIG_MEADOW_PWR_MGMT_SUPPORT)

// Diagnostic only
// #define USE_MEADOW_DEBUG_HELPERS
#undef USE_MEADOW_DEBUG_HELPERS
#include <meadow/meadow_debug_helpers.h>

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

// The timer 5, channel 4 input is the only input that can be connected to LSI
// clock.
// STM32_APB1_TIM5_CLKIN is 96MHz assuming 192MHz MPU clock speed
#define PWRMGMT_CLK_TIMER_5_BASE_CLOCK_FREQ (STM32_APB1_TIM5_CLKIN)
#define PWRMGMT_CLK_CAL_TARGET_FREQUENCY (32768.00)     // Ideal clock source freq
#define PWRMGMT_CLK_CAL_MEASURE_CLK_COUNT (100)         // Test LSI freq x times
#define PWRMGMT_CLK_CAL_MEASURE_CLK_DELAY (5000)        // Wait x usec between tests

// Only set this to 1 for testing
#define PWRMGMT_CLK_SHOW_RTC_TIME_FOR_TESTING (1)       // Output RTC for testing

/************************************************************************************
 * Private Data
 ************************************************************************************/
static char *thisFile = __FILE__;

volatile uint32_t _prevISRCount;
volatile uint32_t _elapsedCount;
static int _pwrmgmt_lsi_calc_thread_id;

// These variables need to be shared 
static uint32_t _lsiRtcPrer;    // Set here, read on to switch

#if HCOM_INCLUDE_PWR_MGMT_TESTS_IN_BUILD > 0
static bool _dbgClkSwitched;    // Set on both sides, read here
#endif

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Private Function Prototypes
 ************************************************************************************/

static int pwrmgmt_lsi_init_timer_5_for_measuring(void);
static int pwrmgmt_create_lsi_calc_thread(void);
static void *pwrmgmt_lsi_calc_prep_thread_func(int argc, char *argv[]);
static int pwrmgmt_lsi_calculate_lsi_clock_freq(double *lsiMeasuredFreq);
static int pwrmgmt_lsi_calc_rtc_prescaler_values(double lsiMeasuredFreq, uint8_t *PreDivA, uint16_t *PreDivS);

/****************************************************************************
 * Private Functions
 ****************************************************************************/
// #if HCOM_INCLUDE_PWR_MGMT_TESTS_IN_BUILD > 0
// static void pwrmgmt_rtc_dumpregs(FAR const char *msg)
// {
//   int rtc_state;

//   // After backup domain reset these are the hardware defined default values
//   // RTC control register (RTC_CR)                    [0]
//   // RTC prescaler register (RTC_PRER)                [0x007f00ff the LSE default]
//   // RTC calibration register (RTC_CALR)              [0]
//   // RTC shift register (RTC_SHIFTR)                  [0]
//   // RTC timestamp register (RTC_TSSSR)               [0]
//   // RTC timestamp register (RTC_TSTR)                [0]
//   // RTC timestamp register (RTC_TSDR)                [0]
//   // RTC tamper configuration register (RTC_TAMPCR)   [0]
//   // RTC backup registers (RTC_BKPxR)                 [all 32 registers to 0]
//   // RTC wakeup timer register (RTC_WUTR)             [0]
//   // RTC Alarm A registers (RTC_ALRMASSR/RTC_ALRMAR)  [both 0]
//   // RTC Alarm B registers (RTC_ALRMBSSR/RTC_ALRMBR)  [both 0]
//   // RTC Option register (RTC_OR)                     [0]

//   syslog(1, "%s:\n", msg);
//   syslog(1, "Registers set to default by Backup Domain Reset\n");
//   syslog(1, "  RTC_CR: %08x\n", getreg32(STM32_RTC_CR));
//   syslog(1, "    PRER: %08x\n", getreg32(STM32_RTC_PRER));
//   syslog(1, "    CALR: %08x\n", getreg32(STM32_RTC_CALR));
//   syslog(1, "  SHIFTR: %08x\n", getreg32(STM32_RTC_SHIFTR));
//   syslog(1, "   TSSSR: %08x\n", getreg32(STM32_RTC_TSSSR));
//   syslog(1, "    TSTR: %08x\n", getreg32(STM32_RTC_TSTR));
//   syslog(1, "    TSDR: %08x\n", getreg32(STM32_RTC_TSDR));
//   syslog(1, "  TAMPCR: %08x\n", getreg32(STM32_RTC_TAMPCR));
//   syslog(1, "    WUTR: %08x\n", getreg32(STM32_RTC_WUTR));
//   syslog(1, "ALRMASSR: %08x\n", getreg32(STM32_RTC_ALRMASSR));
//   syslog(1, "  ALRMBR: %08x\n", getreg32(STM32_RTC_ALRMBR));
//   syslog(1, "ALRMBSSR: %08x\n", getreg32(STM32_RTC_ALRMBSSR));
//   syslog(1, "  ALRMAR: %08x\n", getreg32(STM32_RTC_ALRMAR));
//   syslog(1, "Other RTC Registers\n");
//   syslog(1, "TR(time): %08x\n", getreg32(STM32_RTC_TR));
//   syslog(1, "DR(date): %08x\n", getreg32(STM32_RTC_DR));
//   syslog(1, "     ISR: %08x\n", getreg32(STM32_RTC_ISR));
//   syslog(1, "MAGICREG: %08x\n", getreg32(RTC_MAGIC_REG));

