WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_calib_lsi_clock.c
//   rtc_state =
//     ((getreg32(STM32_EXTI_RTSR) & EXTI_RTC_ALARM) ? 0x1000 : 0) |
//     ((getreg32(STM32_EXTI_FTSR) & EXTI_RTC_ALARM) ? 0x0100 : 0) |
//     ((getreg32(STM32_EXTI_IMR)  & EXTI_RTC_ALARM) ? 0x0010 : 0) |
//     ((getreg32(STM32_EXTI_EMR)  & EXTI_RTC_ALARM) ? 0x0001 : 0);
//   syslog(1, "EXTI (RTSR FTSR ISR EVT): %01x\n",rtc_state);
// }
// #endif

//=============================================================
// This function returns a value that is set here
uint32_t pwrmgmt_get_lsi_calib_rtc_clk_value()
{
  return _lsiRtcPrer;
}

//=============================================================
#if HCOM_INCLUDE_PWR_MGMT_TESTS_IN_BUILD > 0
// This is set here and set and read where switching clocks
bool pwrmgmt_get_dbg_clk_switched_flag()
{
  return _dbgClkSwitched;
}

void pwrmgmt_set_dbg_clk_switched_flag(bool dbgClkSwitched)
{
  _dbgClkSwitched = dbgClkSwitched;
}

#endif

//=============================================================
// This ISR is only used to measure the LSI frequency for a moment
static int pwrmgmt_lsi_use_isr_lsi_clock(int irq, void *context, void *arg)
{  
  uint16_t timStatusReg = getreg16(STM32_TIM5_SR);

  // Get interrupt on rising edge
  if(timStatusReg & GTIM_SR_CC4IF)
  {
    timStatusReg &= ~GTIM_SR_CC4IF;
  
    uint32_t currentCount = getreg32(STM32_TIM5_CCR4);

    // Roll over? If it did ignore data
    if(currentCount > _prevISRCount)
    {
      // No, didn't roll over save count for non-isr processing
      _elapsedCount = currentCount - _prevISRCount;
    }

    _prevISRCount = currentCount;
  }

  putreg16(timStatusReg, STM32_TIM5_SR);
  return OK;
}

//=============================================================
// Enable timer 5 for calibration
static void pwrmgmt_lsi_enable_timer_5(void)
{
  uint16_t cr1Val = getreg16(STM32_TIM5_CR1);
  cr1Val |= GTIM_CR1_CEN;
  
  uint16_t egrVal = getreg16(STM32_TIM5_EGR);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, STM32_TIM5_EGR);
  putreg16(cr1Val, STM32_TIM5_CR1);
}

//=============================================================
// Disable timer 5 for calibration
static void pwrmgmt_lsi_disable_timer_5(void)
{
  uint16_t regval = getreg16(STM32_TIM5_CR1);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, STM32_TIM5_CR1);
}

//=============================================================
static void rtc_wprunlock(void)
{
  // Sets the PWR_CR1_DBP bit in the STM32_PWR_CR1_OFFSET register
  // Ref Man 4.4.1 PWR power control register (PWR_CR1)
  stm32_pwr_enablebkp(true);

  // Enable write access to RTC Registers
  putreg32(0xca, STM32_RTC_WPR);
  putreg32(0x53, STM32_RTC_WPR);
}

//=============================================================
static inline void rtc_wprlock(void)
{
  // Disable write access to RTC Registers
  putreg32(0xff, STM32_RTC_WPR);

  // Clears the PWR_CR1_DBP bit in the STM32_PWR_CR1_OFFSET register
  // Ref Man 4.4.1 PWR power control register (PWR_CR1)
  stm32_pwr_enablebkp(false);
}

//=============================================================
// Set RTC_ISR_INIT bit in STM32_RTC_ISR and wait for RTC_ISR_INITF bit
static int rtc_enterinit(void)
{
  volatile uint32_t timeout;
  uint32_t regval;
  int ret;

  // Check if the Initialization mode is already set
  regval = getreg32(STM32_RTC_ISR);

  ret = OK;
  // RTC_ISR_INITF bit = 1 means calendar register update allowed
  if ((regval & RTC_ISR_INITF) == 0)
  {
    // Set the Initialization mode bit
    putreg32(RTC_ISR_INIT, STM32_RTC_ISR);

    // Wait until the RTC is in the INIT state (or a timeout occurs)
    ret = -ETIMEDOUT;
    for (timeout = 0; timeout < 10000; timeout++)
    {
      regval = getreg32(STM32_RTC_ISR);

      // Loop till calendar register update allowed (i.e. not 0)
      if ((regval & RTC_ISR_INITF) != 0)
      {
        ret = OK;
        break;
      }
    }
  }
  else
  {
    MEADOW_TRACE_DEBUG("===> rtc_enterinit() on Entry found RTC_ISR_INITF == 0\n");
  }

  return ret;
}

//=============================================================
static void rtc_exitinit(void)
{
  uint32_t regval;

  regval = getreg32(STM32_RTC_ISR);
  regval &= ~(RTC_ISR_INIT);
  putreg32(regval, STM32_RTC_ISR);

  return;
}

//====================================================================
// This function is called during startup. It is responsible for finding the
// LSI clock frequency and the needed factors for calibrating the RTC hardware.
// This function creates a thread so the rest of the initialization
// isn't stalled waiting for this to finish. Why not do this on demand? Because
// this requires Timer 5 to be setup a special way. And at runtime timer 5 has
// other responsibilites.
int pwrmgmt_init_lsi_calib(void)
{
  int ret;

  _lsiRtcPrer = 0;

#if HCOM_INCLUDE_PWR_MGMT_TESTS_IN_BUILD > 0
  _dbgClkSwitched = false;
#endif

  // This call will initialize and enable timer 5 which is the only one that
  // can be used to measure the LSI's frequency. It will also turn-on the LSI
  // clock.
  ret = pwrmgmt_lsi_init_timer_5_for_measuring();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI init TIM5 failed:%d\n", thisFile, __LINE__, ret);
    return ret;
  }

  // Create a thread to do the calibration work. The results will be stored in
  // a battery backed register.
  ret = pwrmgmt_create_lsi_calc_thread();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI calc freq failed:%d\n", thisFile, __LINE__, ret);
    return ret;
  }
  
  return ret;
}

//=====================================================================
// Create a thread to do the early initialization
int pwrmgmt_create_lsi_calc_thread()
{
  // Create a thread to use for experimenting
  _pwrmgmt_lsi_calc_thread_id = kthread_create(PWRMGMT_CAL_LSI_THREAD_NAME,
                                  PWRMGMT_CAL_LSI_THREAD_PRIORITY,
                                  PWRMGMT_CAL_LSI_THREAD_STACKSIZE,
                                  (main_t) pwrmgmt_lsi_calc_prep_thread_func,
                                  (char *const *) NULL);
  if (_pwrmgmt_lsi_calc_thread_id <= 0)
  {
    syslog(LOG_ERR, "%s@%d-Creation of %s kthread FAILED\n",
              thisFile, __LINE__, PWRMGMT_CAL_LSI_THREAD_NAME);
    return -ENOEXEC;
  }

  return OK;
}

