WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_calib_lsi_clock.c
//=============================================================
// This thread function will calculate the calibration needed for the LSI
// clocks timing error. It is called before entering the low-power mode.
void *pwrmgmt_lsi_calc_prep_thread_func(int argc, char *argv[])
{
  int ret;
  double lsiMeasuredFreq;
  uint8_t PreDivA = 0;
  uint16_t PreDivS = 0;
  uint32_t rtcPrer;

  // Under some undetermined conditions RTC pre-scaler could become 0x007f00ff
  // while Nuttx is using the HSE clock. A 0x007f00ff is the correct
  // pre-scaler for LSE clock, which we cannot use. Meaning that this
  // pre-scaler value is way wrong! This patch corrects this error.
  rtcPrer = getreg32(STM32_RTC_PRER);
  if(rtcPrer == 0x007f00ff)
  {
    MEADOW_TRACE_DEBUG("At startup detected wrong pre-scaler:0x%08x\n", rtcPrer);

    // Unlock RTC registers
    rtc_wprunlock();
    ret = rtc_enterinit();
    if(ret == -ETIMEDOUT)
    {
      syslog(LOG_ERR, "%s@%d-STARTUP->RTC INIT state timed out\n", thisFile, __LINE__);
      return NULL;
    }

    // Hardcoded HSE pre-scaler values.
    rtcPrer = (uint32_t)PWRMGMT_CLK_HSE_DIV_S_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_S_SHIFT |
               (uint32_t)PWRMGMT_CLK_HSE_DIV_A_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_A_SHIFT;
    putreg32(rtcPrer, STM32_RTC_PRER);

    rtc_exitinit();
    rtc_wprlock();
  }

#if defined(USE_MEADOW_DEBUG_HELPERS)
  uint32_t clkSrc = getreg32(STM32_RCC_BDCR) & RCC_BDCR_RTCSEL_MASK;
  uint32_t rtcPRER = getreg32(STM32_RTC_PRER);
  uint32_t rtcPrerDBG = (uint32_t)PWRMGMT_CLK_HSE_DIV_S_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_S_SHIFT |
                (uint32_t)PWRMGMT_CLK_HSE_DIV_A_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_A_SHIFT;
  MEADOW_TRACE_DEBUG(">>> At startup, clkSrc:0x%08x, rtc pre-scaler:0x%08x and HSE default:0x%08x\n",
            clkSrc, rtcPRER, rtcPrerDBG);
#endif

  ret = pwrmgmt_lsi_calculate_lsi_clock_freq(&lsiMeasuredFreq);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI clock average error\n", thisFile, __LINE__);
    return NULL;
  }

  // Finshed with Timer 5
  up_disable_irq(STM32_IRQ_TIM5);

  pwrmgmt_lsi_disable_timer_5();

  // We have the LSI frequency. Next find the pre-scaler factors that yield
  // the desired divisor needed for this frequency.
  ret = pwrmgmt_lsi_calc_rtc_prescaler_values(lsiMeasuredFreq,
            &PreDivA, &PreDivS);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI clock pre-scaler calc error\n", thisFile, __LINE__);
    return NULL;
  }

  MEADOW_TRACE_DEBUG("FREQ Calc1->Correct pre-scaler values are PreDivA:%u(0x%08x), PreDivS:%u(0x%08x), product:%u\n",
            PreDivA, PreDivA, PreDivS, PreDivS, PreDivA * PreDivS);

  // We have the pre-scaler factors needed to do the calibration
  // Convert PreDivA and PreDivS to the 32-bit value that will be written
  // to the RTC_PRER register.
  _lsiRtcPrer = (uint32_t)PreDivS << RTC_PRER_PREDIV_S_SHIFT |
          (uint32_t)PreDivA << RTC_PRER_PREDIV_A_SHIFT;

  up_disable_irq(STM32_IRQ_TIM5);
  
#if PWRMGMT_CLK_SHOW_RTC_TIME_FOR_TESTING > 0
  //---------------------------------------------------------------------
  // If tests are enabled, this thread won't exit when calibration is completed
  //
  struct tm tmNow;
  int nextSec = 0;
  int secondCount = 0;
  int errorCount = 0;
  int statusSecond = 0;
  char *clkName = "";
  uint32_t clkSrc;

  // First switch to the LSI or HSE clock. If neither of these functions are
  // called  then the Nuttx default clock will be used, probably HSE.
  //
  // ret = pwrmgmt_use_as_rtc_clock_source_lsi();
  ret = pwrmgmt_use_as_rtc_clock_source_hse();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Switching to HSE/LSI failed\n", thisFile, __LINE__);
    return NULL;
  }

  // Do first time config
  _dbgClkSwitched = true;

  // Allow the clock to fully start first
  sleep(1);

  // We want to check the seconds to determine if any are skipped or reported
  // twice.
  while(true)
  {
    // The following gets the time (ultimately from the nuttx system timer)
    // struct timespec abstime;
    // clock_gettime(CLOCK_REALTIME, &abstime);
    // gmtime_r(&abstime.tv_sec, &tmNow);

    // Get time from the hardware RTC. Because the /arch/arm/src/stm32f7/stm32_rtc.c
    // driver doesn't allow CONFIG_RTC_HIRES to be configured, clock_gettime()
    // returns the nuttx system timer based time. This is a Nuttx short coming!
    up_rtc_getdatetime(&tmNow);

    if(_dbgClkSwitched)
    {
      clkSrc = getreg32(STM32_RCC_BDCR) & RCC_BDCR_RTCSEL_MASK;
      if(clkSrc == RCC_BDCR_RTCSEL_LSI)
        clkName = "LSI\0";
      else
        clkName = "HSE\0";

      syslog(2, "==> Using the %s clock\n", clkName);

      errorCount = 0;
      secondCount = 0;
      statusSecond = 0;
      nextSec = tmNow.tm_sec;

      _dbgClkSwitched = false;
    }

    secondCount++;

    if(nextSec != tmNow.tm_sec)
    {
      // Ignore errors first few
      if(secondCount > 2)
      {
        errorCount++;
        if(errorCount > 0)
        {
          syslog(2, "Clock time error #%03d in %03d seconds:%02d Seconds/Error\n",
                  errorCount, secondCount, secondCount/errorCount);
        }
      }
    }

    // Periodically show what's going on
    if((secondCount % 30) == statusSecond)
    {
       syslog(2, "(%s) After %03d seconds, Error count:%03d (Sec/Err:%02d) [rtcPrer:0x%08x]\n",
                clkName, secondCount,
                errorCount, secondCount/errorCount,
                getreg32(STM32_RTC_PRER));
    }
    
    // Show the date & time on every loop
    syslog(2, "Time check #%03u - %4d-%02d-%02dT%02d:%02d:%02d\n",
              secondCount,
              tmNow.tm_year + 1900, tmNow.tm_mon + 1, tmNow.tm_mday,
              tmNow.tm_hour, tmNow.tm_min, tmNow.tm_sec);

    // Seconds run from 0 - 59
    nextSec = tmNow.tm_sec + 1;
    if(nextSec > 59)
      nextSec = 0;

    // 999 millisec sleep is closer to a 1.000 second period
    usleep(999*1000);
  }
#endif

  return NULL;
}

//=============================================================
// Low-level register setup for Timer 5
int pwrmgmt_lsi_init_timer_5_for_measuring(void)
{
  int ret;
  uint16_t regVal16;
  uint32_t regVal32;

  // Before starting disable capture/control for all channels. Ref Man (26.4.7 at
  // end) "Note: CC1S bits are writable only when the channel is OFF (i.e.
  // CC1E = 0 in TIMx_CCER)." 
  regVal16 = getreg16(STM32_TIM5_CCER);
  regVal16 &= 0xeeee;   // e = 1110, clear CCxE bits 0, 4, 8 & 12
  putreg16(regVal16, STM32_TIM5_CCER);
  
  // Timer5 Option Register is used to connect GPIO (default), LSI, LSE or 
  // RTC wakeup interrupt to Timer 5 Channel 4
  regVal16 = getreg16(STM32_TIM5_OR);
  regVal16 &= ~TIM5_OR_TI4_RMP_MASK;  // Clear the bits
  regVal16 |= TIM5_OR_TI4_LSI;        // Use LSI to measure its frequency
  putreg16(regVal16, STM32_TIM5_OR);
  
  // 01: CC4 channel mapped on TI4
  regVal32 = getreg32(STM32_TIM5_CCMR2);
  regVal32 |= 0x00000100;   // 0x0100 = 0100, set bits 9:8
  putreg32(regVal32, STM32_TIM5_CCMR2);
  
